In [1]:
import numpy as np
import pandas as pd

In [2]:
first_series = pd.Series(list('abcdef'))

In [3]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [7]:
#Creating series form an ndarray
np_avenger = np.array(['Iron Man','captian America','spider man','hulk','thor'])

In [9]:
s_avenger = pd.Series(np_avenger)
print(s_avenger)

0           Iron Man
1    captian America
2         spider man
3               hulk
4               thor
dtype: object

In [10]:
#Creating Series from Dict
dict_student_avg = pd.Series([85,57,99,79,65],
                             index=['abc','def','ghi','jkl','mno'])
print(dict_student_avg)

abc    85
def    57
ghi    99
jkl    79
mno    65
dtype: int64

In [12]:
dict_student_avg[0]

57

In [13]:
dict_student_avg[0:5]

abc    85
def    57
ghi    99
jkl    79
mno    65
dtype: int64

In [14]:
dict_student_avg.loc['def']

57

In [15]:
dict_student_avg.iloc[3]

79

In [11]:
#Creating series from scalar
scalar_series = pd.Series(5.,index=['a','b','c','d','e','f'])
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
f    5.0
dtype: float64

In [20]:
#Vectorzing Operation in Series
first_vector_series = pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'])

In [21]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [22]:
second_vector_series = pd.Series([10,20,30,40],index=['d','c','b','a'])

In [23]:
first_vector_series+second_vector_series

a    41
b    32
c    23
d    14
dtype: int64

In [24]:
second_vector_series = pd.Series([10,20,30,40],index=['a','f','e','b'])
first_vector_series+second_vector_series

a    11.0
b    42.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [25]:
#creating dataframes from lists
olympic_data_list = {'HostCity':['London','Sydney','Athens'],
                    'Year':[2012,2000,2004],
                    'No.of Participating Countries':[205,200,201]}
df_olympic_data = pd.DataFrame(olympic_data_list)
df_olympic_data

  HostCity  Year  No.of Participating Countries
0   London  2012                            205
1   Sydney  2000                            200
2   Athens  2004                            201

In [26]:
df_olympic_data.HostCity

0    London
1    Sydney
2    Athens
Name: HostCity, dtype: object

In [27]:
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No.of Participating Countries
0   London  2012                            205
1   Sydney  2000                            200
2   Athens  2004                            201>

In [28]:
#Creating DataFrame from Dict of series
olympic_series_participation = pd.Series([205,200,201],index=[2012,2000,2004])
olympic_series_country = pd.Series(['London','Sydney','Athens'],
                                  index=[2012,2000,2004])

In [29]:
df_olympic_series = pd.DataFrame({'No of Participating Countries':olympic_series_participation,
                                 'Host Cities':olympic_series_country})
df_olympic_series

      No of Participating Countries Host Cities
2012                            205      London
2000                            200      Sydney
2004                            201      Athens

In [30]:
#Creating DataFrame from ndarray
np_array = np.array([2012,2000,2004])
dict_ndarray = {'year': np_array}

In [31]:
df_ndarray = pd.DataFrame(dict_ndarray)
df_ndarray

   year
0  2012
1  2000
2  2004

In [32]:
#creating df from df object
df_from_df = pd.DataFrame(df_olympic_series)
df_from_df

      No of Participating Countries Host Cities
2012                            205      London
2000                            200      Sydney
2004                            201      Athens

# MISSING VALUES

In [36]:
sum_of_series = first_vector_series+second_vector_series
sum_of_series

a    11.0
b    42.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [37]:
dropna_s = sum_of_series.dropna()
dropna_s

a    11.0
b    42.0
dtype: float64

In [38]:
fillna_s = sum_of_series.fillna(0)
fillna_s

a    11.0
b    42.0
c     0.0
d     0.0
e     0.0
f     0.0
dtype: float64

In [40]:
#fill values with zeroes before performing addition in place of missing values
fill_NaN_with_zeros_before_sum = first_vector_series.add(second_vector_series, fill_value = 0)
fill_NaN_with_zeros_before_sum

a    11.0
b    42.0
c     3.0
d     4.0
e    30.0
f    20.0
dtype: float64

# Data Operation

In [45]:
df_movie_rating = pd.DataFrame(
{
    'movie 1': [5,4,3,2,1,2,2,5],
    'movie 2': [1,2,3,4,5,4,3,2]},
    index = ['ab','bc','cd','df','fg','ed','tg','kl']
)
df_movie_rating

    movie 1  movie 2
ab        5        1
bc        4        2
cd        3        3
df        2        4
fg        1        5
ed        2        4
tg        2        3
kl        5        2

In [47]:
#creating a function for grading the movie according to ratings
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

In [48]:
print(movie_grade(5))

A

In [49]:
df_movie_rating.applymap(movie_grade)

   movie 1 movie 2
ab       A       F
bc       B       F
cd       C       C
df       F       B
fg       F       A
ed       F       B
tg       F       C
kl       A       F

In [51]:
df_test_scores = pd.DataFrame(
{
    'test1':[25,56,48,47,35,85,65],
    'test2':[87,98,75,86,94,75,95]},
    index = ['a','b','c','d','e','f','g']
)

In [52]:
df_test_scores.max()

test1    85
test2    98
dtype: int64

In [53]:
df_test_scores.mean()

test1    51.571429
test2    87.142857
dtype: float64

In [54]:
df_test_scores.std()

test1    19.713423
test2     9.335034
dtype: float64

In [55]:
def standardize_tests(test):
    return (test-test.mean())/test.std()

In [56]:
standardize_tests(df_test_scores['test1'])

a   -1.347885
b    0.224648
c   -0.181167
d   -0.231894
e   -0.840616
f    1.695726
g    0.681189
Name: test1, dtype: float64

In [58]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)       #apply the function to entire dataset

In [59]:
standardize_test_scores(df_test_scores)

      test1     test2
a -1.347885 -0.015303
b  0.224648  1.163053
c -0.181167 -1.300783
d -0.231894 -0.122427
e -0.840616  0.734560
f  1.695726 -1.300783
g  0.681189  0.841683

# SQL Operaton

In [60]:
import sqlite3

In [61]:
#Create SQL Table
create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"""

In [62]:
#execute SQL statements
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [63]:
#prepare SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [64]:
#fetch result from SQLlite database
resultset = SQL_query.fetchall()
resultset

[]

In [65]:
#prepare records to be insertedd into sql table through sql statement
insertSQL = [(10,'abc',20,30),
            (20,'bcd',85,74)]

In [67]:
#insert records into sql table through sql statement
insert_statement = 'Insert into student_score values(?,?,?,?)'
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [68]:
#prepare SQL Query
SQL_query = executeSQL.execute('select * from student_score')

In [69]:
#fetch the resultset fro the query
resultset = SQL_query.fetchall()
resultset

[(10, 'abc', 20.0, 30.0), (20, 'bcd', 85.0, 74.0)]